"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Подсказка:
Базовый случай здесь - угадали число или закончились попытки

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def guess_number(number, n=1):
	user_number = int(input("Введите число от 0 до 100: "))
	if n == 10:
		return "Вы не угадали, было загадано число {}".format(number)
	elif user_number == number:
		return "Вы угадали, было загадано число {}".format(number)
	else:
		if number < user_number:
			print("Вы не угадали, загаданное число меньше.")
		else:
			print("Вы не угадали, загаданное число больше.")
		return guess_number(number, n + 1)
		
		
print(guess_number(59))
